ukmaker/ForthCPUEmulator/ForthImage_ATMEGA328.h
#ifndef UKMAKER_FORTH_IMAGE_H
#define UKMAKER_FORTH_IMAGE_H
#include "FArduino.h"
/******************************
* Constants
*****************************/
#define FORTH_ROMSIZE 0x2c
#define FORTH_SYSTEM 0x0000
#define FORTH_RAMSTART 0x2400
#define FORTH_VARSTART 0x2600
#define FORTH_SPTOP 0x2780
#define FORTH_RSTOP 0x27fe
#define FORTH_LBUF_LEN 0x0050
#define FORTH_BASE_DEC 0x000a
#define FORTH_BASE_HEX 0x0010
#define FORTH_BASE_BIN 0x0002
#define FORTH_SYSCALL_DEBUG 0x0000
#define FORTH_SYSCALL_TYPE 0x0001
#define FORTH_SYSCALL_TYPELN 0x0002
#define FORTH_SYSCALL_DOT 0x0003
#define FORTH_SYSCALL_GETC 0x0004
#define FORTH_SYSCALL_PUTC 0x0005
#define FORTH_SYSCALL_INLINE 0x0006
#define FORTH_SYSCALL_FLUSH 0x0007
#define FORTH_SYSCALL_NUMBER 0x0008
#define FORTH_SYSCALL_H_AT 0x0009
#define FORTH_SYSCALL_H_STORE 0x000a
#define FORTH_SYSCALL_D_ADD 0x000b
#define FORTH_SYSCALL_D_SUB 0x000c
#define FORTH_SYSCALL_D_MUL 0x000d
#define FORTH_SYSCALL_D_DIV 0x000e
#define FORTH_SYSCALL_D_SR 0x000f
#define FORTH_SYSCALL_D_SL 0x0010
#define FORTH_SYSCALL_D_AND 0x0011
#define FORTH_SYSCALL_D_OR 0x0012
#define FORTH_SYSCALL_D_INVERT 0x0013
#define FORTH_SYSCALL_DOT_C 0x0014
#define FORTH_SYSCALL_COMPARE 0x0015
#define FORTH_SYSCALL_FREE_MEMORY 0x0016
#define FORTH_SYSCALL_SYSCALL 0x0017
#define FORTH_SYSCALL_ARDUINO 0x0018
#define FORTH_SYSCALL_QEXIT 0x0019
#define FORTH_SYSCALL_FOPEN 0x0020
#define FORTH_SYSCALL_FCLOSE 0x0021
#define FORTH_SYSCALL_FREAD 0x0022
#define FORTH_MODE_EXECUTE 0x0000
#define FORTH_MODE_COMPILE 0x0001
#define FORTH_STATE_NOT_FOUND 0x0000
#define FORTH_STATE_FOUND 0x0001
#define FORTH_HEADER_MASK 0x00ff
#define FORTH_HEADER_HEADER_BIT 0x000f
#define FORTH_HEADER_SCOPE_BITS 0x000c
#define FORTH_HEADER_PASSIVE 0x8000
#define FORTH_HEADER_IMMEDIATE 0x9000
#define FORTH_HEADER_RUNTIME 0xa000
#define FORTH_HEADER_EXECUTIVE 0xb000
#define FORTH_HEADER_COMPILETIME 0xc000
#define FORTH_HEADER_HAS_LOCALS 0x0800
const uint8_t rom[44] PROGMEM = {
/* 0x0000 */   0x00 ,0x82 ,0x2a ,0x00 ,0x00 ,0x82 ,0x36 ,0x00    /*   ‚ *     ‚ 6   */
/* 0x0008 */  ,0x00 ,0x82 ,0x00 ,0x00 ,0x0d ,0x52 ,0x0d ,0x52    /*   ‚       R   R */
/* 0x0010 */  ,0x0d ,0x52 ,0x0e ,0x42 ,0x10 ,0x40 ,0x00 ,0xc5    /*   R   B   @   Å */
/* 0x0018 */  ,0x02 ,0x4b ,0x20 ,0x59 ,0xf2 ,0x00 ,0x10 ,0xc9    /*   K   Y ò     É */
/* 0x0020 */  ,0x00 ,0x83 ,0x0e ,0x42 ,0x0e ,0x42 ,0x0e ,0x42    /*   ƒ   B   B   B */
/* 0x0028 */  ,0x0f ,0x80 ,0x00 ,0x41    /*   €   A */
}; // rom
#endif // UKMAKER_FORTH_IMAGE_H
